# x1=int(input('Укажите зааплату за месяц '))
# x2=int(input('Укажите платеж по кредиту за месяц'))
# x3=int(input('Укажите задолженность за ком. услуги'))
# print('У вас останется =', x1-x2-x3)

'''Напишите программу, вычисляющую площадь ромба. 
Пользователь с клавиатуры вводит длину двух его диагоналей'''

d1=int(input('Укажите длину первой диоганали - '))
d2=int(input('Укажите длину второй диоганали - '))
print ('Площадь ромба с диоганалями d1 и d2 равна S =', (d1*d2)/2)
# fgffgffggf

x = int(input("Собака на прогулке гавкает несколько раз чтобы человек "
              "понял что ему нужно: "))
if x > 6:
    print('хочет поиграть с палкой')

elif x >= 3:
    print('хочет исследовать')

else:
    print('хочет домой')
